% 16 вариант
clc % чистим терминал
clear all % удалаем все переменные с рабочей области

dx = 0.0002; % Шаг интегрирования
e = 0.00005; % «Точность» ε 

x = -2:0.01:2; % задаём диапазон от -2 до 2 с шагом 0.01

i = 0;
for x_ = x % запускаем цикл с диапазоном x (8 строка)
    i = i + 1;
    if x_ < -1 % на промежутке от -2 до -1
        y(i) = 1;
    elseif x_ < 1 % на промежутке от -1 до 1
        % код для расчитывания интегралла методом прямоугольников
        y(i) = 0;
        for z = -1:dx:x_
            y(i) = y(i) + (2 * cos(z) + z * tan(z));
        end
        y(i) = y(i) * dx;
    else % на промежутке от 1 до 2
        % код для рассчитывания сумы
        y(i) = sin(x_);
        n = 0;
        x_n = 2 .* e;
        factI = 1;
        xPow = 1;
        while abs(x_n) >= e
            x_n = xPow ./ factI;
            y(i) = y(i) + x_n;
            n = n + 1;
            xPow = xPow .* (((-1) .^ n) .* x_n .^ (x_n .* n) );
            fact = 1;
            for j = 1:(2 .* n)
                fact = fact * j
            end
            factI = factI .* fact;
        end
    end
end

% рисуем график
plot(x,y) 
xlabel("x") 
ylabel("y") 
grid on 
